<a href="https://colab.research.google.com/github/Vageeswari-kanchiuniv/C/blob/main/DATA_WRANGLING.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **DATA WRANGLING  **

In [1]:
import pandas as pd
import numpy as np

**Data Creation**

In [2]:



data = {
    'ID': [1, 2, 3, 4, 5, 6],
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve', 'Frank'],
    'Gender': ['F', 'M', 'M', 'F', 'F', None],
    'Age': [25, np.nan, 35, 28, 22, 30],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 60000, 70000, 65000, 48000, 72000]
}

df = pd.DataFrame(data)
print("ðŸ”¹ Original Data:")
print(df)

ðŸ”¹ Original Data:
   ID     Name Gender   Age Department  Salary
0   1    Alice      F  25.0         HR   50000
1   2      Bob      M   NaN         IT   60000
2   3  Charlie      M  35.0    Finance   70000
3   4     None      F  28.0         IT   65000
4   5      Eve      F  22.0         HR   48000
5   6    Frank   None  30.0    Finance   72000

Data Cleaning

In [5]:

# Handling missing values
df['Name'] = df['Name'].fillna('Unknown')
df['Gender'] = df['Gender'].fillna('Other')
df['Age'] = df['Age'].fillna(df['Age'].mean())


# Changing data types
df['Age'] = df['Age'].astype(int)

# Renaming columns
df.rename(columns={'Salary': 'Monthly_Salary'}, inplace=True)
print(df)

   ID     Name Gender  Age Department  Monthly_Salary
0   1    Alice      F   25         HR           50000
1   2      Bob      M   28         IT           60000
2   3  Charlie      M   35    Finance           70000
3   4  Unknown      F   28         IT           65000
4   5      Eve      F   22         HR           48000
5   6    Frank  Other   30    Finance           72000

Transformation

In [7]:
# Mapping values
df['Gender_Full'] = df['Gender'].map({'M': 'Male', 'F': 'Female', 'Other': 'Other'})

# Applying custom function
df['Age_Group'] = df['Age'].apply(lambda x: 'Senior' if x >= 30 else 'Junior')

# Replacing values
df['Department'] = df['Department'].replace({'HR': 'Human Resources'})
print(df)

   ID     Name Gender  Age       Department  Monthly_Salary Gender_Full  \
0   1    Alice      F   25  Human Resources           50000      Female
1   2      Bob      M   28               IT           60000        Male
2   3  Charlie      M   35          Finance           70000        Male
3   4  Unknown      F   28               IT           65000      Female
4   5      Eve      F   22  Human Resources           48000      Female
5   6    Frank  Other   30          Finance           72000       Other

  Age_Group
0    Junior
1    Junior
2    Senior
3    Junior
4    Junior
5    Senior


Aggregation

In [8]:
grouped_salary = df.groupby('Department')['Monthly_Salary'].mean()
print("\nðŸ”¹ Average Salary by Department:")
print(grouped_salary)

# Pivot table
pivot = pd.pivot_table(df, values='Monthly_Salary', index='Department', columns='Gender_Full', aggfunc='mean')
print("\nðŸ”¹ Pivot Table (Avg Salary):")
print(pivot)

ðŸ”¹ Average Salary by Department:
Department
Finance            71000.0
Human Resources    49000.0
IT                 62500.0
Name: Monthly_Salary, dtype: float64

ðŸ”¹ Pivot Table (Avg Salary):
Gender_Full       Female     Male    Other
Department
Finance              NaN  70000.0  72000.0
Human Resources  49000.0      NaN      NaN
IT               65000.0  60000.0      NaN

Filtering and Selection

In [9]:


# Conditional filtering
high_earners = df[df['Monthly_Salary'] > 60000]
print("\nðŸ”¹ High Earners:")
print(high_earners)

# Using query
it_staff = df.query('Department == "IT"')
print("\nðŸ”¹ IT Department Staff:")
print(it_staff)

ðŸ”¹ High Earners:
   ID     Name Gender  Age Department  Monthly_Salary Gender_Full Age_Group
2   3  Charlie      M   35    Finance           70000        Male    Senior
3   4  Unknown      F   28         IT           65000      Female    Junior
5   6    Frank  Other   30    Finance           72000       Other    Senior

ðŸ”¹ IT Department Staff:
   ID     Name Gender  Age Department  Monthly_Salary Gender_Full Age_Group
1   2      Bob      M   28         IT           60000        Male    Junior
3   4  Unknown      F   28         IT           65000      Female    Junior

Reshaping

In [10]:
# Melting
melted = pd.melt(df, id_vars=['ID', 'Name'], value_vars=['Age', 'Monthly_Salary'])
print("\nðŸ”¹ Melted Data:")
print(melted.head())

# Stack/Unstack (on a small sample)
stacked = df[['Department', 'Monthly_Salary']].head(3).stack()
print("\nðŸ”¹ Stacked Sample:")
print(stacked)

ðŸ”¹ Melted Data:
   ID     Name variable  value
0   1    Alice      Age     25
1   2      Bob      Age     28
2   3  Charlie      Age     35
3   4  Unknown      Age     28
4   5      Eve      Age     22

ðŸ”¹ Stacked Sample:
0  Department        Human Resources
   Monthly_Salary              50000
1  Department                     IT
   Monthly_Salary              60000
2  Department                Finance
   Monthly_Salary              70000
dtype: object

Merging and Joining

In [11]:
# Create another DataFrame for merging
bonus_df = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5, 6],
    'Bonus': [2000, 2500, 3000, 2800, 2200, 3200]
})

# Merge
merged_df = pd.merge(df, bonus_df, on='ID', how='inner')
print("\nðŸ”¹ Merged Data with Bonus:")
print(merged_df)

ðŸ”¹ Merged Data with Bonus:
   ID     Name Gender  Age       Department  Monthly_Salary Gender_Full  \
0   1    Alice      F   25  Human Resources           50000      Female
1   2      Bob      M   28               IT           60000        Male
2   3  Charlie      M   35          Finance           70000        Male
3   4  Unknown      F   28               IT           65000      Female
4   5      Eve      F   22  Human Resources           48000      Female
5   6    Frank  Other   30          Finance           72000       Other

  Age_Group  Bonus
0    Junior   2000
1    Junior   2500
2    Senior   3000
3    Junior   2800
4    Junior   2200
5    Senior   3200

Sorting and Duplicates

In [13]:
# ------------------------

# Adding a duplicate for demo


df_with_dup = pd.concat([df, df.iloc[[0]]], ignore_index=True)


# Remove duplicates
df_no_dup = df_with_dup.drop_duplicates()

# Sort
sorted_df = df.sort_values(by='Monthly_Salary', ascending=False)
print("\nðŸ”¹ Sorted by Salary (Descending):")
print(sorted_df)

ðŸ”¹ Sorted by Salary (Descending):
   ID     Name Gender  Age       Department  Monthly_Salary Gender_Full  \
5   6    Frank  Other   30          Finance           72000       Other
2   3  Charlie      M   35          Finance           70000        Male
3   4  Unknown      F   28               IT           65000      Female
1   2      Bob      M   28               IT           60000        Male
0   1    Alice      F   25  Human Resources           50000      Female
4   5      Eve      F   22  Human Resources           48000      Female

  Age_Group
5    Senior
2    Senior
3    Junior
1    Junior
0    Junior
4    Junior

Export to CSV

In [14]:
df.to_csv('cleaned_employee_data.csv', index=False)
print("\nâœ… Cleaned data exported to 'cleaned_employee_data.csv'")

âœ… Cleaned data exported to 'cleaned_employee_data.csv'